STMicroelectronics/STM32CubeG4/Projects/B-G474E-DPOW1/Applications/Digital_Power/Buck_CurrentMode_HW/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file         main.c
  * @author       STMicroelectronics
  * @brief        Main program body
  * @details      This file provides main function and peripheral init 
                  functions
  ******************************************************************************
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file in
  * the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  ******************************************************************************
  *
 * @history Date       Version Person  Change
 * @history ---------- ------- ------- ----------------------------------------
  * @history 2020-02-14 1.0     PBo     Created with the support of Biricha Digital Power LTd
  * @history 2021-11-19 1.0     NSa     Updating file according "Common" application source code
  * @history 2021-11-19 1.0     NSa     Updated open loop mode duty cycle to 10% as 5% is lower than deadtime
                                        thus not being observable as in app note
  * @history 2022-01-04 1.0     RGo     Header modifications
  * @history 2022-01-10 2.0     NSa     Moved Systick_Handler to ISR file and Load_Handler to 
  *                                     app code file
 */

/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32g4xx_it.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */
#define RUN_OPEN_LOOP
/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc1;
DMA_HandleTypeDef hdma_adc1;

COMP_HandleTypeDef hcomp6;

DAC_HandleTypeDef hdac4;

FMAC_HandleTypeDef hfmac;

HRTIM_HandleTypeDef hhrtim1;

OPAMP_HandleTypeDef hopamp5;

RTC_HandleTypeDef hrtc;

/* USER CODE BEGIN PV */
float Vdrop = SLOPE_VPP;
float Vdrop_old = 0.0;
extern G4_Demo_t Demo;
extern WAVEFORM_DISPLAY_INFO_t Waveform;


/* FMAC configuration structure */
FMAC_FilterConfigTypeDef sFmacConfig;
DMA_HandleTypeDef hdma_fmac_read;

/* Array of filter coefficients A (feedback coefficients) in Q1.15 format */
static int16_t aFilterCoeffA[COEFF_VECTOR_A_SIZE] = {A1,A2};

/* Array of filter coefficients B (feed-forward taps) in Q1.15 format */
static int16_t aFilterCoeffB[COEFF_VECTOR_B_SIZE] = {(int16_t)-B0,(int16_t)-B1,(int16_t)-B2};

/* Array of output data to preload in Q1.15 format */
static int16_t aOutputDataToPreload[COEFF_VECTOR_A_SIZE] = {0x0000, 0x0000};

/* Expected number of calculated samples */
uint16_t ExpectedCalculatedOutputSize = (uint16_t) 1;
uint32_t *Fmac_Wdata;
int16_t Fmac_output;
int16_t bTransient = 0;

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_DMA_Init(void);
static void MX_RTC_Init(void);
static void MX_ADC1_Init(void);
static void MX_HRTIM1_Init(void);
static void MX_FMAC_Init(void);
static void MX_COMP6_Init(void);
static void MX_DAC4_Init(void);
static void MX_OPAMP5_Init(void);
/* USER CODE BEGIN PFP */
extern uint16_t HAL_HRTIM_NsToTicks(HRTIM_HandleTypeDef *hhrtim, uint32_t Timers, int ns);
extern uint16_t HAL_HRTIM_FreqToTicks(HRTIM_HandleTypeDef *hhrtim, uint32_t Timers, int FreqHz);
extern uint16_t HAL_HRTIM_DeadBandNsToTicks(int ns);

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */

/**
  * @brief This set the slope for the DAC.
  * @details
  * The sets the total drop across the PWM period required.
  * We use DAC1 channel 1&2 since channel 1 is connected to the external pin
  * but channel 2 is actually used for the controller.
  */
void SetRamp( float SlopeV )
{
  uint16_t update;
  float stepV;
  uint16_t step;
  uint16_t NumUpdates = 75; // Max updates per period is determiend by the max update rate of the DAC
  
  update = Demo.periodBuck / NumUpdates;
  stepV = SlopeV/NumUpdates;
  
  /* DacDrop = (Vdrop * 4096*16(fractional)/3.3V) */
  step = (uint16_t)((stepV * DAC_MAX * 16)/3.3);
  
  /* Update the sawtooth waveform generator with the required step size */
  LL_DAC_SetWaveSawtoothStepData(DAC4, LL_DAC_CHANNEL_2, step);
  __HAL_HRTIM_SETCOMPARE( &hhrtim1, HRTIM_TIMERINDEX_TIMER_C, HRTIM_COMPAREUNIT_2, update);
}

void ConfigFmac2p2z( void )
{

  /* Configure the FMAC peripheral */
  sFmacConfig.InputBaseAddress  = INPUT_BUFFER_BASE;
  sFmacConfig.InputBufferSize   = INPUT_BUFFER_SIZE;
  sFmacConfig.InputThreshold    = INPUT_THRESHOLD;
  sFmacConfig.CoeffBaseAddress  = COEFFICIENT_BUFFER_BASE;
  sFmacConfig.CoeffBufferSize   = COEFFICIENT_BUFFER_SIZE;
  sFmacConfig.OutputBaseAddress = OUTPUT_BUFFER_BASE;
  sFmacConfig.OutputBufferSize  = OUTPUT_BUFFER_SIZE;
  sFmacConfig.OutputThreshold   = OUTPUT_THRESHOLD;
  sFmacConfig.pCoeffA           = aFilterCoeffA;
  sFmacConfig.CoeffASize        = COEFF_VECTOR_A_SIZE;
  sFmacConfig.pCoeffB           = aFilterCoeffB;
  sFmacConfig.CoeffBSize        = COEFF_VECTOR_B_SIZE;
  sFmacConfig.Filter            = FMAC_FUNC_IIR_DIRECT_FORM_1;
  sFmacConfig.InputAccess       = FMAC_BUFFER_ACCESS_NONE;
  sFmacConfig.OutputAccess      = FMAC_BUFFER_ACCESS_IT;
  sFmacConfig.Clip              = FMAC_CLIP_ENABLED;
  sFmacConfig.P                 = COEFF_VECTOR_B_SIZE;
  sFmacConfig.Q                 = COEFF_VECTOR_A_SIZE;
  sFmacConfig.R                 = post_shift;

  
  if (HAL_FMAC_FilterConfig(&hfmac, &sFmacConfig) != HAL_OK)
  {
    /* Configuration Error */
    Error_Handler();
  }

  /* Preload the input and output buffers */
  if (HAL_FMAC_FilterPreload(&hfmac, NULL, INPUT_BUFFER_SIZE,
                           aOutputDataToPreload, COEFF_VECTOR_A_SIZE) != HAL_OK)
  {
    /* Configuration Error */
    Error_Handler();
  }
  /* Start calculation of IIR filter */
   if (HAL_FMAC_FilterStart(&hfmac,&Fmac_output,&ExpectedCalculatedOutputSize) != HAL_OK)
  {
    /* Processing Error */
    Error_Handler();
  }
  
  /* We want to disable over and underrun so if we hit a breakpoint we can continue*/ 
  __HAL_FMAC_DISABLE_IT(&hfmac, FMAC_IT_OVFLIEN|FMAC_IT_UNFLIEN);  
  

