STMicroelectronics/STM32CubeG4/Projects/B-G474E-DPOW1/Applications/Digital_Power/Buck_CurrentMode_HW/Src/main.c
}
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_RTC_Init();
  MX_ADC1_Init();
  MX_HRTIM1_Init();
  MX_FMAC_Init();
  MX_COMP6_Init();
  MX_DAC4_Init();
  MX_OPAMP5_Init();
  /* USER CODE BEGIN 2 */

  /* Perform an ADC automatic self-calibration and enable ADC */
  if (HAL_ADCEx_Calibration_Start(&hadc1, ADC_SINGLE_ENDED) != HAL_OK)
  {
    /* Configuration Error */
    Error_Handler();
  }

  /* Configure and start FMAC */
  ConfigFmac2p2z();
  
#ifndef RUN_OPEN_LOOP
  /* Start the DMA which is used to move ADC result to the FMAC */
  if (HAL_ADC_Start_DMA(&hadc1, (uint32_t *) &hfmac.Instance->WDATA, 1) != HAL_OK)
  {
    /* Configuration Error */
    Error_Handler();
  }
#endif
  
  /* Disable the DMA interrupts */
  __HAL_DMA_DISABLE_IT(&hdma_adc1, DMA_IT_HT | DMA_IT_TC );     

  /* Enables DAC and starts conversion of the channel */
  if (HAL_DAC_Start(&hdac4, DAC_CHANNEL_2) != HAL_OK)
  {
    /* Configuration Error */
    Error_Handler();
  }
  
  /* Start the comparator to detect the peak current trip threshold */
  if (HAL_COMP_Start(&hcomp6) != HAL_OK)
  {
    /* Configuration Error */
    Error_Handler();
  }
  
#ifndef RUN_OPEN_LOOP
  /* Start the OPAMP which allows us to view the demand peak current value on the scope */
  if (HAL_OPAMP_Start(&hopamp5) != HAL_OK)
  {
    /* Configuration Error */
    Error_Handler();
  }  
#endif
  
  
  /* Calculate PWM period and update timer register */
  Demo.periodBuck = HAL_HRTIM_FreqToTicks(&hhrtim1, HRTIM_TIMERINDEX_TIMER_C, SwitchFreq);
  __HAL_HRTIM_SETPERIOD(&hhrtim1, HRTIM_TIMERINDEX_TIMER_C, Demo.periodBuck);
  
#ifdef RUN_OPEN_LOOP  
  /* Open loop so run with a small fixed duty cycle */
  __HAL_HRTIM_SETCOMPARE(&hhrtim1, HRTIM_TIMERINDEX_TIMER_C, HRTIM_COMPAREUNIT_1, Demo.periodBuck * 10 / 100);
#else
  /* Set max duty to 80% of period */
  __HAL_HRTIM_SETCOMPARE(&hhrtim1, HRTIM_TIMERINDEX_TIMER_C, HRTIM_COMPAREUNIT_1, Demo.periodBuck * 80 / 100);
#endif  
  /* Set number of slope compensation steps per period to 75 */
  __HAL_HRTIM_SETCOMPARE(&hhrtim1, HRTIM_TIMERINDEX_TIMER_C, HRTIM_COMPAREUNIT_2, Demo.periodBuck / 75);
  /* Set blanking period */
  __HAL_HRTIM_SETCOMPARE(&hhrtim1, HRTIM_TIMERINDEX_TIMER_C, HRTIM_COMPAREUNIT_3, HAL_HRTIM_NsToTicks(&hhrtim1, HRTIM_TIMERINDEX_TIMER_C,500)); // Allow 300ns for blanking + 200ns for rising edge delay
  /* Set PWM rising edge to 200ns after the start of the period */
  __HAL_HRTIM_SETCOMPARE(&hhrtim1, HRTIM_TIMERINDEX_TIMER_C, HRTIM_COMPAREUNIT_4, HAL_HRTIM_NsToTicks(&hhrtim1, HRTIM_TIMERINDEX_TIMER_C,200)); //200ns after start of period

  
  /* Start the PWMs */
  HAL_HRTIM_WaveformOutputStart(&hhrtim1, HRTIM_OUTPUT_TC1 | HRTIM_OUTPUT_TC2); // Enable output
  HAL_HRTIM_WaveformCounterStart(&hhrtim1, HRTIM_TIMERID_TIMER_C); // Enable counter

  /* Enable T6 for Buck only mode usage */
  HAL_GPIO_WritePin(GPIOB, BUCKBOOST_P2_DRIVE_Pin, GPIO_PIN_SET);
  

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    if (bTransient)
    {
      // Toggle blue LED
      HAL_GPIO_WritePin(GPIOA, LED_DOWN_BLUE_Pin, GPIO_PIN_SET);

      // Toggle both loads
      HAL_GPIO_TogglePin(GPIOC, BUCKBOOST_LOAD_1_Pin);
      HAL_GPIO_TogglePin(GPIOC, BUCKBOOST_LOAD_2_Pin);
      HAL_GPIO_TogglePin(GPIOB, LED_RIGHT_GREEN_Pin);
      HAL_GPIO_TogglePin(GPIOB, LED_LEFT_ORANGE_Pin);
          
      // Delay
      HAL_Delay(500);    
    } else {
      // Clear blue LED
      HAL_GPIO_WritePin(GPIOA, LED_DOWN_BLUE_Pin, GPIO_PIN_RESET);
    }
    
	/* If the user has updated the amount of slope compensation then call SetRamp() to update slope generator */
    if (Vdrop != Vdrop_old)
    {
      SetRamp( Vdrop );
      Vdrop_old = Vdrop;
    }
    
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

/**
  * @brief System Clock Configuration
  * @retval None
  */
void SystemClock_Config(void)
{
  RCC_OscInitTypeDef RCC_OscInitStruct = {0};
  RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

  /** Configure the main internal regulator output voltage
  */
  HAL_PWREx_ControlVoltageScaling(PWR_REGULATOR_VOLTAGE_SCALE1_BOOST);

  /** Initializes the RCC Oscillators according to the specified parameters
  * in the RCC_OscInitTypeDef structure.
  */
  RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI|RCC_OSCILLATORTYPE_LSI;
  RCC_OscInitStruct.HSIState = RCC_HSI_ON;
  RCC_OscInitStruct.HSICalibrationValue = RCC_HSICALIBRATION_DEFAULT;
  RCC_OscInitStruct.LSIState = RCC_LSI_ON;
  RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
  RCC_OscInitStruct.PLL.PLLM = RCC_PLLM_DIV4;
  RCC_OscInitStruct.PLL.PLLN = 85;
  RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV6;
  RCC_OscInitStruct.PLL.PLLQ = RCC_PLLQ_DIV2;
  RCC_OscInitStruct.PLL.PLLR = RCC_PLLR_DIV2;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
  {
    Error_Handler();
  }

  /** Initializes the CPU, AHB and APB buses clocks
  */
  RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                              |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV1;
  RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_4) != HAL_OK)
  {
    Error_Handler();
  }
}

/**
  * @brief ADC1 Initialization Function
  * @param None
  * @retval None
  */
static void MX_ADC1_Init(void)
{

  /* USER CODE BEGIN ADC1_Init 0 */

